In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
from pandas.plotting import register_matplotlib_converters
from pylab import rcParams
sns.set_style("darkgrid")

import warnings
warnings.filterwarnings("ignore")

***
***

In [2]:
df1 = pd.read_csv("orders_dimen.csv")
df1.head(10)

   Order_Date Order_Priority  Ord_id
0  13-10-2010            LOW   Ord_1
1  01-10-2012           HIGH   Ord_2
2  10-07-2011           HIGH   Ord_3
3  28-08-2010  NOT SPECIFIED   Ord_4
4  17-06-2011           HIGH   Ord_5
5  24-03-2011           HIGH   Ord_6
6  26-02-2010            LOW   Ord_7
7  23-11-2010         MEDIUM   Ord_8
8  08-06-2012  NOT SPECIFIED   Ord_9
9  04-08-2012  NOT SPECIFIED  Ord_10

In [3]:
df1["Order_Date"] = pd.to_datetime(df1["Order_Date"],format='%d-%m-%Y')

In [13]:
#df5 = pd.read_csv("orders_dimen.csv", parse_dates=["Order_Date"])

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5506 entries, 0 to 5505
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Date      5506 non-null   datetime64[ns]
 1   Order_Priority  5506 non-null   object
 2   Ord_id          5506 non-null   object
dtypes: datetime64[ns](1), object(2)
memory usage: 129.2+ KB

In [6]:
df1.head()

  Order_Date Order_Priority Ord_id
0 2010-10-13            LOW  Ord_1
1 2012-01-10           HIGH  Ord_2
2 2011-10-07           HIGH  Ord_3
3 2010-08-28  NOT SPECIFIED  Ord_4
4 2011-06-17           HIGH  Ord_5

In [5]:
df1.to_csv("orders_dimen2.csv", date_format='%Y-%m-%d')

***
***

In [8]:
# df2 = pd.read_csv("shipping_dimen.csv", parse_dates=["Ship_Date"])

In [7]:
df2 = pd.read_csv("shipping_dimen.csv")

In [8]:
df2

      Order_ID       Ship_Mode   Ship_Date   Ship_id
0            3     REGULAR AIR  20-10-2010     SHP_1
1          293  DELIVERY TRUCK  02-10-2012     SHP_2
2          293     REGULAR AIR  03-10-2012     SHP_3
3          483     REGULAR AIR  12-07-2011     SHP_4
4          515     REGULAR AIR  30-08-2010     SHP_5
...        ...             ...         ...       ...
7696     55558  DELIVERY TRUCK  09-08-2010  SHP_7697
7697     55558     REGULAR AIR  11-08-2010  SHP_7698
7698     56550     EXPRESS AIR  10-04-2011  SHP_7699
7699     56550     REGULAR AIR  09-04-2011  SHP_7700
7700     56581     EXPRESS AIR  11-02-2009  SHP_7701

[7701 rows x 4 columns]

In [10]:
df2["Ship_Date"] = pd.to_datetime(df2["Ship_Date"],format='%d-%m-%Y')

In [12]:
df2.to_csv("shipping_dimen2.csv", date_format='%Y-%m-%d')

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7701 entries, 0 to 7700
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Order_ID   7701 non-null   int64
 1   Ship_Mode  7701 non-null   object
 2   Ship_Date  7701 non-null   datetime64[ns]
 3   Ship_id    7701 non-null   object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 240.8+ KB

In [15]:
df2.head()

   Order_ID       Ship_Mode  Ship_Date Ship_id
0         3     REGULAR AIR 2010-10-20   SHP_1
1       293  DELIVERY TRUCK 2012-02-10   SHP_2
2       293     REGULAR AIR 2012-03-10   SHP_3
3       483     REGULAR AIR 2011-12-07   SHP_4
4       515     REGULAR AIR 2010-08-30   SHP_5

***
***